src/Documents/ОтчетОДоставке/ОтчетОДоставке.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>ОтчетОДоставке</name>
  <registerRecords>InformationRegister.СтатусыДоставкиСвернуто</registerRecords>
  <registerRecords>InformationRegister.СтатусыЗаявокВТК</registerRecords>
  <registerRecords>InformationRegister.СтатусыДоставки</registerRecords>
  <attributes>
    <name>ВидОперации</name>
    <type>
      <types>EnumRef.ВидыОперацийОтчетОДоставке</types>
    </type>
  </attributes>
  <attributes>
    <name>Примечание</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>150</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ДатаДоставки</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ГруппыДоставки</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <tabularSections>
    <name>Заказы</name>
    <attributes>
      <name>Груз</name>
      <type>
        <types>CatalogRef.Коробки</types>
      </type>
    </attributes>
    <attributes>
      <name>Заявка</name>
      <type>
        <types>DocumentRef.ЗаявкаВТранспортнуюКомпанию</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>ЗаявкиВТК</name>
    <attributes>
      <name>Заявка</name>
      <type>
        <types>DocumentRef.ЗаявкаВТранспортнуюКомпанию</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Document>

src/InformationRegisters/СтатусыДоставки/СтатусыДоставки.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>СтатусыДоставки</name>
  <informationRegisterPeriodicity>RecorderPosition</informationRegisterPeriodicity>
  <writeMode>RecorderSubordinate</writeMode>
  <resources>
    <name>Статус</name>
    <type>
      <types>EnumRef.СтатусыОтправкиГруза</types>
    </type>
  </resources>
  <attributes>
    <name>ОриентеровачнаяДатаДоставки</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>НомерЗаявки</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>25</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ДатаЗаявки</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <dimensions>
    <name>Груз</name>
    <type>
      <types>DocumentRef.ОтправлениеТранзита</types>
      <types>CatalogRef.Коробки</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

src/InformationRegisters/СтатусыДоставкиСвернуто/СтатусыДоставкиСвернуто.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>СтатусыДоставкиСвернуто</name>
  <informationRegisterPeriodicity>RecorderPosition</informationRegisterPeriodicity>
  <writeMode>RecorderSubordinate</writeMode>
  <resources>
    <name>Количество</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>КоличествоГС</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>КоличествоМест</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </resources>
  <dimensions>
    <name>ЗаявкаВТК</name>
    <type>
      <types>DocumentRef.ЗаявкаВТранспортнуюКомпанию</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Статус</name>
    <type>
      <types>EnumRef.СтатусыОтправкиГруза</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

src/InformationRegisters/СтатусыЗаявокВТК/СтатусыЗаявокВТК.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>СтатусыЗаявокВТК</name>
  <informationRegisterPeriodicity>RecorderPosition</informationRegisterPeriodicity>
  <writeMode>RecorderSubordinate</writeMode>
  <dimensions>
    <name>Заявка</name>
    <type>
      <types>DocumentRef.ЗаявкаВТранспортнуюКомпанию</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Статус</name>
    <type>
      <types>EnumRef.СтатусыОтправкиГруза</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

src/Enums/ВидыОперацийОтчетОДоставке/ВидыОперацийОтчетОДоставке.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>ВидыОперацийОтчетОДоставке</name>
  <enumValues>
    <name>Доставлен</name>
  </enumValues>
  <enumValues>
    <name>Утрачен</name>
  </enumValues>
</mdclass:Enum>

src/Enums/СтатусыОтправкиГруза/СтатусыОтправкиГруза.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>СтатусыОтправкиГруза</name>
  <enumValues>
    <name>НаСкладе</name>
  </enumValues>
  <enumValues>
    <name>СформирванаЗаявкаВТК</name>
  </enumValues>
  <enumValues>
    <name>ВыехалСТочки</name>
  </enumValues>
  <enumValues>
    <name>ВТранспортнойКомпании</name>
  </enumValues>
  <enumValues>
    <name>Доставлен</name>
  </enumValues>
  <enumValues>
    <name>Утрачен</name>
  </enumValues>
  <enumValues>
    <name>ДобавленСчетЭК</name>
  </enumValues>
  <enumValues>
    <name>ОтПоставщика</name>
  </enumValues>
  <enumValues>
    <name>ОжидаетДоставки</name>
  </enumValues>
  <enumValues>
    <name>ОжидаетПолучения</name>
  </enumValues>
</mdclass:Enum>

src/Enums/ВидыСтикеров/ВидыСтикеров.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>ВидыСтикеров</name>
  <enumValues>
    <name>ГС</name>
  </enumValues>
  <enumValues>
    <name>ЗаказТК</name>
  </enumValues>
  <enumValues>
    <name>ГруппаДоставки</name>
  </enumValues>
</mdclass:Enum>

src/Documents/ЗаявкаВТранспортнуюКомпанию/ЗаявкаВТранспортнуюКомпанию.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>ЗаявкаВТранспортнуюКомпанию</name>
  <registerRecords>InformationRegister.СтатусыДоставкиСвернуто</registerRecords>
  <registerRecords>InformationRegister.СтатусыЗаявокВТК</registerRecords>
  <registerRecords>InformationRegister.СтатусыДоставки</registerRecords>
  <attributes>
    <name>ТранспортнаяКомпания</name>
    <type>
      <types>CatalogRef.Контрагенты</types>
    </type>
  </attributes>
  <attributes>
    <name>Вес</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Объем</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>3</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Количество</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>НомерЗаявки</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>50</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ДатаЗаявки</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>КоличествоМест</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>НомерОтправителя</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>12</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ТочкаТранзита</name>
    <type>
      <types>CatalogRef.ТочкиРаздачи</types>
    </type>
  </attributes>
  <attributes>
    <name>СвояТочка</name>
    <type>
      <types>CatalogRef.ТочкиРаздачи</types>
    </type>
  </attributes>
  <tabularSections>
    <name>Заказы</name>
    <attributes>
      <name>Груз</name>
      <type>
        <types>CatalogRef.Коробки</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Document>

src/Documents/ОтчетОДоставке/ObjectModule.bsl
Процедура ОбработкаПроведения(Отказ, РежимПроведения)
	УстановитьВыдачуВГруппуДоставки(Отказ);

	ДвиженияСтатусыДоставки(Отказ, РежимПроведения) ;
	ДвиженияСтатусыДоставкиСвернуто(Отказ, РежимПроведения);

	ДвиженияСтатусыЗаявокВТК(Отказ, РежимПроведения);
КонецПроцедуры

Процедура ДвиженияСтатусыДоставки(Отказ, Режим)
	Движения.СтатусыДоставки.Записывать = Истина;
	Для Каждого ТекСтрокаПокупки Из Заказы Цикл
		Движение = Движения.СтатусыДоставки.Добавить();
		Движение.Период = Дата;
		Движение.Груз = ТекСтрокаПокупки.Груз;
		Движение.Статус = ?(ВидОперации=Перечисления.ВидыОперацийОтчетОДоставке.Доставлен,Перечисления.СтатусыОтправкиГруза.Доставлен,Перечисления.СтатусыОтправкиГруза.Утрачен);
	КонецЦикла;
КонецПроцедуры

Процедура ДвиженияСтатусыДоставкиСвернуто(Отказ, Режим)
	Движения.СтатусыДоставкиСвернуто.Записывать = Истина;
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	ОтчетОДоставкеЗаказы.Заявка как ЗаявкаВТК,
		|	ВЫБОР
		|		КОГДА ОтчетОДоставкеЗаказы.Ссылка.ВидОперации = ЗНАЧЕНИЕ(Перечисление.ВидыОперацийОтчетОДоставке.Доставлен)
		|			ТОГДА ЗНАЧЕНИЕ(Перечисление.СтатусыОтправкиГруза.Доставлен)
		|		ИНАЧЕ ЗНАЧЕНИЕ(Перечисление.СтатусыОтправкиГруза.Утрачен)
		|	КОНЕЦ КАК Статус,
		|	ОтчетОДоставкеЗаказы.Ссылка.Дата КАК Период,
		|	ОтчетОДоставкеЗаказы.Заявка.КоличествоМест КАК КоличествоМест,
		|	СУММА(ОтчетОДоставкеЗаказы.Груз.Количество) КАК Количество,
		|	СУММА(1) КАК КоличествоГС
		|ИЗ
		|	Документ.ОтчетОДоставке.Заказы КАК ОтчетОДоставкеЗаказы
		|ГДЕ
		|	ОтчетОДоставкеЗаказы.Ссылка = &Ссылка
		|
		|СГРУППИРОВАТЬ ПО
		|	ОтчетОДоставкеЗаказы.Заявка,
		|	ВЫБОР
		|		КОГДА ОтчетОДоставкеЗаказы.Ссылка.ВидОперации = ЗНАЧЕНИЕ(Перечисление.ВидыОперацийОтчетОДоставке.Доставлен)
		|			ТОГДА ЗНАЧЕНИЕ(Перечисление.СтатусыОтправкиГруза.Доставлен)
		|		ИНАЧЕ ЗНАЧЕНИЕ(Перечисление.СтатусыОтправкиГруза.Утрачен)
		|	КОНЕЦ,
		|	ОтчетОДоставкеЗаказы.Ссылка.Дата,
		|	ОтчетОДоставкеЗаказы.Заявка.КоличествоМест";
	Запрос.Параметры.Вставить("Ссылка",Ссылка);
	РезультатЗапроса = Запрос.Выполнить();
	Движения.СтатусыДоставкиСвернуто.Загрузить(РезультатЗапроса.Выгрузить());

	
КонецПроцедуры




Процедура ОбработкаПроверкиЗаполнения(Отказ, ПроверяемыеРеквизиты)
	СПКонтрольДоставкиГрузов.ПроверитьУникальностьСтатусаДляГруза(ЭтотОбъект,Отказ);
КонецПроцедуры


Процедура ПередЗаписью(Отказ, РежимЗаписи, РежимПроведения)
	Если ОбменДанными.Загрузка Тогда
		Возврат;
	КонецЕсли;
	СПКонтрольДоставкиГрузов.ЗаполнитьЗаявкиПоКоробкам(ЭтотОбъект,"Заказы","Груз");

	
	
	
КонецПроцедуры

Процедура ПриЗаписи(Отказ)
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	ОтчетОДоставкеЗаявкиВТК.Заявка,
		|	ОтчетОДоставкеЗаявкиВТК.Ссылка
		|ИЗ
		|	Документ.ОтчетОДоставке.ЗаявкиВТК КАК ОтчетОДоставкеЗаявкиВТК
		|ГДЕ
		|	ОтчетОДоставкеЗаявкиВТК.Ссылка <> &Ссылка
		|	И ОтчетОДоставкеЗаявкиВТК.Заявка В(&СписокЗаявок)
		|	И ОтчетОДоставкеЗаявкиВТК.Ссылка.Проведен
		|	И ОтчетОДоставкеЗаявкиВТК.Ссылка.ВидОперации = &ВидОперации 
		|	И ОтчетОДоставкеЗаявкиВТК.Заявка <> ЗНАЧЕНИЕ(Документ.ЗаявкаВТранспортнуюКомпанию.ПустаяСсылка)";
	Запрос.УстановитьПараметр("СписокЗаявок", ЗаявкиВТК.ВыгрузитьКолонку("Заявка"));
	Запрос.УстановитьПараметр("Ссылка", Ссылка);
	Запрос.УстановитьПараметр("ВидОперации", ВидОперации);

	РезультатЗапроса = Запрос.Выполнить();
	
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	
	Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю("Заявка "+ВыборкаДетальныеЗаписи.Заявка+" уже закрыта доокументом "+ВыборкаДетальныеЗаписи.ссылка,,,,Отказ); 
	КонецЦикла;
КонецПроцедуры


Процедура ДвиженияСтатусыЗаявокВТК(Отказ, Режим)
	Движения.СтатусыЗаявокВТК.Записывать = Истина;
	Для каждого стр Из ЗаявкиВТК Цикл
		Если не ЗначениеЗаполнено(стр.Заявка) Тогда продолжить; КонецЕсли;
		Движение = Движения.СтатусыЗаявокВТК.Добавить();
		Движение.Период = Дата;
		Движение.Заявка= стр.Заявка;
		Если ВидОперации=Перечисления.ВидыОперацийОтчетОДоставке.Доставлен Тогда
			Движение.Статус = Перечисления.СтатусыОтправкиГруза.Доставлен;
		Иначе
			Движение.Статус = Перечисления.СтатусыОтправкиГруза.Утрачен;
		КонецЕсли;
	КонецЦикла;
КонецПроцедуры



Процедура ЗаполнитьПоСпискуЗаявок(СписокЗаявок) Экспорт
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	ЗаявкаВТранспортнуюКомпаниюЗаказы.Груз,
		|	ЗаявкаВТранспортнуюКомпаниюЗаказы.Ссылка КАК Заявка
		|ИЗ
		|	Документ.ЗаявкаВТранспортнуюКомпанию.Заказы КАК ЗаявкаВТранспортнуюКомпаниюЗаказы
		|ГДЕ
		|	ЗаявкаВТранспортнуюКомпаниюЗаказы.Ссылка В(&СписокЗаявок)";
	
	Запрос.УстановитьПараметр("СписокЗаявок", СписокЗаявок);

	РезультатЗапроса = Запрос.Выполнить();
	тз=РезультатЗапроса.Выгрузить();
	Заказы.Загрузить(тз);	
	тз.Свернуть("Заявка");
	ЗаявкиВТК.Загрузить(ТЗ);
КонецПроцедуры	




Процедура ЗаполнитьПоСпискуКоробок(СписокКоробок) Экспорт
	Для каждого стр из СписокКоробок Цикл
		заказ=Заказы.Добавить()	;
		заказ.Груз=стр.Значение.ГД;
	КОнецЦикла;
КонецПроцедуры	


#Область ГруппыДоставки
Процедура УстановитьВыдачуВГруппуДоставки(Отказ)
	
	Для каждого стр из Заказы Цикл
		Если не (ТипЗнч(стр.Груз)=Тип("СправочникСсылка.Коробки") и
			стр.Груз.ВидСтикера=Перечисления.ВидыСтикеров.ГруппаДоставки) Тогда Продолжить КонецЕсли;

	
		Если стр.Груз.ОтчетОДоставке<>Ссылка  Тогда
			Если ЗначениеЗаполнено(стр.Груз.ОтчетОДоставке)   Тогда
				ТекстСообщения="Группа доставки "+стр.Покупка+"уже доставлена  "+стр.Груз.ОтчетОДоставке;
				ОбщегоНазначенияКлиентСервер.СообщитьПользователю(ТекстСообщения,,,,Отказ);
				Продолжить;
			КонецЕсли;
		КонецЕсли;	
		обКоробка=стр.Груз.ПолучитьОбъект();
		обКоробка.ОтчетОДоставке=Ссылка;
		Попытка
			обКоробка.Записать();
		Исключение
		КонецПопытки;
	КонецЦикла;	
КонецПроцедуры

Процедура ОбработкаУдаленияПроведения(Отказ)
	Для каждого стр из Заказы Цикл
		Если не (ТипЗнч(стр.Груз)=Тип("СправочникСсылка.Коробки") и
			стр.Груз.ВидСтикера=Перечисления.ВидыСтикеров.ГруппаДоставки) Тогда Продолжить КонецЕсли;
		
		обКоробка=стр.Груз.ПолучитьОбъект();
		обКоробка.ОтчетОДоставке=Документы.ОтчетОДоставке.ПустаяСсылка();
		Попытка
			обКоробка.Записать();
		Исключение
			Отказ =Истина;
		КонецПопытки;
	КонецЦикла;
КонецПроцедуры

#КонецОбласти
